{
    "delta-4-theory-how-to-evaluate-your-startup-idea": [
        {
            "Name": "Robin John",
            "Date": "2021-01-08",
            "Comment": "Excellent article!\n Can you prepare a database or list of companies who have achieved Delta-4?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-01-08",
            "Comment": "<span class='author-marker'></span>Hi Robin!\n \nThanks for the reply. Let me know if you're interested to collaborate. I'm actually planning to include that in the post itself, but it requires some extensive research. Also I'm planning to build a sample set of people to evaluate and score the efficiencies."
        },
        {
            "Name": "Vamsi Karatam",
            "Date": "2022-02-20",
            "Comment": "Hello Rishikesh, I have gone through the article and saw the Kunal Shah video on this article, looking to evaluate my idea with Delta 4 theory or not. What is the best way to reach you."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-02-21",
            "Comment": "<span class='author-marker'></span>Hi Vamsi,\n \n Can you send me a message using the contact form on the website? Or send an email to rishikeshshari[at]gmail[dot]com"
        },
        {
            "Name": "Pavan",
            "Date": "2022-02-11",
            "Comment": "I will be happy to collaborate. Zerodha is one example comes to mind in India. bootstrapped, no funding took on big sharks at the time who didn't bother to provide any UI/UX experience. They changed the game with technology better UI/UX and became no.1"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-02-21",
            "Comment": "<span class='author-marker'></span>Hey Pavan!\n \n Can you send me mesage using the contact form? Let;s together write a case study about Zerodha!"
        },
        {
            "Name": "Roshaan Narkedayy",
            "Date": "2023-05-15",
            "Comment": "Nice Written version of Kunal Video\n \n Thanks Vamsi"
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-22",
            "Comment": "Thanks a lot! <span class='author-marker'></span>"
        }
    ],
    "5-reasons-why-i-decided-to-start-a-blog": [
        {
            "Name": "Robin John",
            "Date": "2021-01-08",
            "Comment": "Nice article. Im curious to see your results by end of this year.\n All the best!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-01-08",
            "Comment": "<span class='author-marker'></span>Thanks Robin!\n \n Yes I'll update this by end of this year. Please subscribe to my newsletter so that you're informed about it as soon as it goes live."
        },
        {
            "Name": "Watto",
            "Date": "2021-01-30",
            "Comment": "Interesting blog just updated one I created a while ago. Good luck with your travels.\n Maybe create a YT channel for your tours?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-01-30",
            "Comment": "<span class='author-marker'></span>Thanks a lot! I was thinking, but I don't really like the world of YouTube!"
        },
        {
            "Name": "EatPanDulce",
            "Date": "2021-02-07",
            "Comment": "Documenting your life will be so insightful. I have been using journaling and photography as a way of documenting my life. It's been interesting to see my handwriting change as well as what I deemed important to write about. My collection of photographs tell a different part of that same story. I hope you gain the insight you are looking for through writing!"
        }
    ],
    "build-a-digital-garden": [
        {
            "Name": "Tom Kotcher",
            "Date": "2021-01-11",
            "Comment": "Great Article!\n How did you enable SSL on your link?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-01-11",
            "Comment": "<span class='author-marker'></span>Hey Tom!\n \n Thanks for checking the article!\n \n I actually use a free service called ZeroSSL to setup SSL across all my sites. Just follow their instructions and you're good to go. All you have to do is to upload a small file in the mentioned directory and you will have your certificate ready!"
        },
        {
            "Name": "Kip Biscoe",
            "Date": "2021-02-02",
            "Comment": "Very good info. Lucky me I recently found your site by accident (stumbleupon). I have saved as a favorite for later!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-02-02",
            "Comment": "<span class='author-marker'></span>Thanks a lot for the support!"
        },
        {
            "Name": "Angel Shroyer",
            "Date": "2021-02-03",
            "Comment": "Thanks for your marvelous posting! I truly enjoyed reading it, you will be a great author.I will make certain to bookmark your blog and definitely will come back at some point. I want to encourage yourself to continue your great writing, have a nice weekend!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-02-06",
            "Comment": "<span class='author-marker'></span>Thanks a lot, Angel!"
        }
    ],
    "stress-journal": [
        {
            "Name": "JAMES T V",
            "Date": "2021-02-02",
            "Comment": "Very informative!"
        }
    ],
    "curator-economy": [
        {
            "Name": "Clementina Pecararo",
            "Date": "2021-02-02",
            "Comment": "Very good post. I am going through some of these issues as well."
        },
        {
            "Name": "Irfan",
            "Date": "2021-02-09",
            "Comment": "Great content. Thanks for writing"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-02-09",
            "Comment": "<span class='author-marker'></span>Thanks a lot Irfan! I'm curious, where did you find me?"
        },
        {
            "Name": "Aakarsh",
            "Date": "2021-02-18",
            "Comment": "Glad to discover your website. Looks like we have a few common things going. Curation based newsletter, Obsidian, some common interests"
        },
        {
            "Name": "Rishikesh",
            "Date": "2021-02-19",
            "Comment": "<span class='author-marker'></span>Hey Aakarsh! Thanks for checking out my website. It's great to connect with like minded people. I have pinged you on Twitter! Would love to hear more from you."
        },
        {
            "Name": "Irfan",
            "Date": "2022-04-03",
            "Comment": "Glad I found you. Keep writing."
        },
        {
            "Name": "Raymond",
            "Date": "2024-01-24",
            "Comment": "Great writeup!"
        }
    ],
    "man-from-the-future": [
        {
            "Name": "Dimitrios",
            "Date": "2022-03-29",
            "Comment": "Well if that were to happen I believe will find the solutions faster and easier rather than thinking about it without being in the situation."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-03-29",
            "Comment": "<span class='author-marker'></span>The whole point of the experiment was to see what we can think of."
        },
        {
            "Name": "D Scott",
            "Date": "2022-03-30",
            "Comment": "This kind of Thought-provoking experiment is so much fun for me and so intriguing. I'll have to think about it and will write more later. I love what you put into it so far. I would love to keep his thought process going and also it really is the grounds for a great book or a movie or screenplay."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-03-30",
            "Comment": "Even I'm thinking of expanding it into a book or a short story! :)<span class='author-marker'></span>"
        },
        {
            "Name": "ABC",
            "Date": "2022-04-02",
            "Comment": "Ironically, the wheel was my very first thought. You've got a great start though, and I agree I wish I knew what flint looked like too!\n Find some tree sap to use as glue. Definitely make a hat to cover your head. Teach proper posture and lifting weights with your legs to minimize the chance of back injury.\n And then I'm thinking further ahead Consider the rules you would make to prevent deforestation or where/how you would sort the trash and compost pile to prevent build-up. Where would you make the toilet to prevent disease? Community outhouse or families all have their own? What about how you would incorporate music, dance, religion, storytelling, etc?\n Would you teach the concept of measurable time? And if so, do you leave 60 minutes in an hour?\n Do you create a system of justice? Do you try and teach equality? Do you separate gender roles? Do you create prophylactics?\n So much to consider!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-02",
            "Comment": "Thanks for the great points.\n \n I have couple of questions:\n \n - How can i define time? How do I define 1s. Or will I have to resort something like a sand clock and calibrate it?\n - Toilets I was planning to dig trench holes few metres deep ideally 200 metres from the water body.\n - Do you think deforestation matters at this small scale?<span class='author-marker'></span>"
        },
        {
            "Name": "S Buch",
            "Date": "2022-04-04",
            "Comment": "Great article and really got me thinking. I'm in the middle of reading Sapiens and recommend it to everyone. It seems like sapiens did a lot of damage to the environment and didn't necessarily create a better or easier life for themselves. Read Sapiens.??? It's an eye opener."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-04",
            "Comment": "Hey! Sapiens is one of my favorite books of all time. I think Sapiens influenced me in a bit in this thought process.<span class='author-marker'></span>"
        },
        {
            "Name": "Alpha",
            "Date": "2022-04-05",
            "Comment": "Hello. I have imagined a new world because I was thinking of this for some years. I have the solution for everything. If you want to communicate with me it's my pleasure.\n P.s. Is that Apollon in your picture?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-05",
            "Comment": "<span class='author-marker'></span>I shall e-mail you to discuss further! I'm not sure if it's Apollon. I downloaded the image from Unsplash!"
        },
        {
            "Name": "Akid",
            "Date": "2022-04-08",
            "Comment": "For time you can make an old school sun-dial which would broadly tell you the hours. Obviously can only be used in the day and not useful if you need minutes."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-08",
            "Comment": "That's a good point. Also, I can calibrate it to get 15 minute variations right?<span class='author-marker'></span>"
        },
        {
            "Name": "John C",
            "Date": "2022-05-13",
            "Comment": "This might be a great help if you find yourself in the distant past.\n \n \n \n https://topatoco.com/products/qw-cheatsheet"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-05-13",
            "Comment": "<span class='author-marker'></span> That is an interesting T-Shirt! How about getting a tattoo? :D"
        }
    ],
    "brilliance-bias": [
        {
            "Name": "AK",
            "Date": "2022-04-17",
            "Comment": "Please see:\n \n https://en.wikipedia.org/wiki/Variability_hypothesis\n \n It is true in humans, and other species. The females perverse genetics, genetic integrity. The males have a riskier hand as they pursue genetic diversity with a higher potential return.\n \n https://www.theguardian.com/science/2014/sep/24/women-men-dna-human-gene-pool\n \n If you, or the average person, thinks of the word Idiot, I doubt you have a woman in mind. Try making the Idiocy bias argument. I predict you already know what will happen.\n \n Which makes this article relevant: https://www.singularity2050.com/2010/01/the-misandry-bubble.html\n \n If you have the patience, it is worth the read, as is its sequel."
        }
    ],
    "energy-calendar": [
        {
            "Name": "Sasha",
            "Date": "2022-04-21",
            "Comment": "This was a novel idea and intriguing. I'll admit I'm not used to having a structured (daily) schedule and the prospect intimidates me, but the prospect of wasting my days intimidates me more. Several articles I've read lately have recommended making a calendar and I appreciate this unique approach. I'll give it a shot!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-21",
            "Comment": "That's great ! Do ping me once you've tried the approach!<span class='author-marker'></span>"
        },
        {
            "Name": "Dipankar",
            "Date": "2022-04-07",
            "Comment": "I just started colour coding my calendar few weeks ago based on colour palettes so that it looks aesthetic.\n \n \n \n But this is a great way to use those colours for yourself (Great idea), I think changing the colours after they are done would be helpful for me.\n \n \n \n Surely I would try this out starting Today!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-07",
            "Comment": "Try it out and let me know how it went. I realised that many of the meetings were actually draining!<span class='author-marker'></span>"
        }
    ],
    "how-i-curate-my-newsletter": [
        {
            "Name": "Susan Pearson",
            "Date": "2022-04-24",
            "Comment": "This was really insightful. I have been trying to work out how to make my 2nd blog/newsletter separate from my main blog. I already use Obsidian and capture blog posts I've read, what I have watched etc. You have inspired me to use my second platform as more of a weekly round-up, thank you."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-24",
            "Comment": "Thanks a lot Susan for the feedback! Please ping me if you need any help in optimizing your newsletter! :)<span class='author-marker'></span>"
        }
    ],
    "single-purpose-devices": [
        {
            "Name": "Udaya",
            "Date": "2022-04-17",
            "Comment": "Good article about the distraction the smartphones cause these days. However, since the smartphones can multitask, they can be handy for you don't have to carry a heavy DSLR, a physical map, a music pod, and your PC for carrying out so many tasks."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-04-17",
            "Comment": "I agree on the convenience part. But this came at a cost and we are distracted like never before due to this. I also enjoy carrying my iPhone instead of my bulky DSLR, but I feel like I'm more mindful when I'm using my camera!<span class='author-marker'></span>"
        },
        {
            "Name": "Sam",
            "Date": "2022-05-07",
            "Comment": "This is a thought provoking article. I encourage people to buy single purpose products if their smartphones are taking a toll on their physical, spiritual and mental health. Like they say limitations are for good reasons and this is especially true for digital devices. There are just a lot distractions on smartphones."
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-05-07",
            "Comment": "Yes, smartphones are quite addictive!<span class='author-marker'></span>"
        }
    ],
    "boring-phone": [
        {
            "Name": "Olivian Breda",
            "Date": "2022-05-01",
            "Comment": "Another tip: Consider switching the phone colors to black & white (grayscale). :)\n \n \n \n https://www.gizbot.com/how-to/tips-tricks/here-s-how-to-enable-grayscale-mode-on-your-android-device-063391.html\n \n \n \n https://betterhumans.pub/how-to-make-your-iphone-black-and-white-and-why-you-should-42e70deb92c7"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-05-01",
            "Comment": "<span class='author-marker'></span> Thanks for the tip! Now I have configured my iPhone to change to bnw on a triple click!"
        },
        {
            "Name": "Valeri",
            "Date": "2023-05-24",
            "Comment": "Set a time limit for your apps. I have IG and FB set to 15 minutes per day."
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-24",
            "Comment": "<span class='author-marker'></span> I have tried it, but often I tend to override those limits."
        }
    ],
    "28-lessons": [
        {
            "Name": "juanper",
            "Date": "2022-05-24",
            "Comment": "Religion or spirituality gives hope to those who believe in it and you have no right to offend anyone's belief UNLESS THEY TRY TO IMPOSE THEIR BELIEFS ON YOU AND/OR CHANGE THE LAW TO SUIT THEIR AGENDA!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2022-05-24",
            "Comment": "Yes. I should have added that part! :D <span class='author-marker'></span>"
        },
        {
            "Name": "Rahul Chowdhury",
            "Date": "2023-05-05",
            "Comment": "Do you have any recommendations for a good memory foam pillow?\n \n \n \n I tried one and I couldn't sleep that night!"
        },
        {
            "Name": "Ingo Vogelmann",
            "Date": "2023-05-19",
            "Comment": "Exactly. As a 50-year-old dude I enjoyed almost all of those points, but this one I can't agree with at all. Religion is a man-made invention to control and rip off the flock. One of the fifty million things I learned in my life. ;-)"
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-19",
            "Comment": "Yes I do agree with that. But what I've learnt over the years is not to interfere in other people's beliefs. I was very defensive at one point in my life and used to question or correct people on their beliefs. Over time I realised if it gives them peace, let it be as long as they don't bother me! <span class='author-marker'></span>"
        }
    ],
    "super-randonneur": [
        {
            "Name": "SANTOSH A",
            "Date": "2023-05-16",
            "Comment": "hardworking beautifully scripted, keep the wheels rolling for long distance..all the best for your LRM's.."
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-16",
            "Comment": "Thanks a lot for the support!<span class='author-marker'></span>"
        },
        {
            "Name": "Sathyan Anbalakan",
            "Date": "2023-05-23",
            "Comment": "Hi sir,\n \n Congratulation on your Super Randonneur season 2022. It is great to enjoy your interesting journey. I am a Super Randonneur from Malaysia for season 2022 and have completed Super Randonneur for season 2023 as well. \n \n Perhaps you should try our Audax event in Malaysia, the most prestigious is our BRM600 Big Hills that I completed recently on 12 February 2023. The total elevation for this BRM600 is 8300m.\n \n Apart from that, you could also try the other BRMs held in Malaysia. Please read more at https://audaxmalaysia.com/."
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-22",
            "Comment": "I would love to ride in Malaysia some day! I heard the community is great! Wow elevation of 8300m is next level! <span class='author-marker'></span>"
        },
        {
            "Name": "JEFFERSON COVOLAN",
            "Date": "2023-05-27",
            "Comment": "Congratulations Brother! I completed the series twice (2018 and 2022), and hope to complete this year as well, since I do have plans for the PBP2023. Reading your testimony brought me all the good memories and consolidated the image that we, Randonneurs, are brothers on the road all over the world."
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-22",
            "Comment": "Hey Jeff!\n It is indeed a great experience!<span class='author-marker'></span>"
        },
        {
            "Name": "Ian Biller",
            "Date": "2024-09-16",
            "Comment": "Just completed my first (and maybe last!) Super Randonneur here in the UK so great to read your story!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-09-16",
            "Comment": "<span class='author-marker'></span>Congrats on the SR achievement. How many BRMs have you completed in your overall career?"
        }
    ],
    "2023-plan": [
        {
            "Name": "Soeren Koenig",
            "Date": "2023-05-21",
            "Comment": "Hey Rishikesh, I just came across your blog and I like your public goal setting, but IMHO with this laundry list of objectives you still spread yourself too thin and some of then you also can not control directly:\n \n - weight (you can promote a healthy weight with your lifestyle of diet, fasting, sleep, exercising, but ultimately, you do not have the control)\n \n - income from your side hustle (also, this is nothing you can have direct control over)\n \n - newsletter subscribers (same here)\n \n \n \n I think it is better to establish a routine of daily habits which pay into your goals: writing at least 15 minutes every day, go to bed at a certain time, read 5 pages every day... etc.\n \n This is kind of automating the process for reaching your goals naturally, over time instead of setting hard-and-fast numbers which put a lot of pressure on you and set you up for failure very easily."
        },
        {
            "Name": "Rishikesh",
            "Date": "2023-05-21",
            "Comment": "Hi Soren!\n \n Yes you are right. I guess I should set some actionable items rather than focusing on the goal. Like I will workout everyday at least for 30minutes. Thanks a lot for your suggestion, I guess I need to relook into my objectives and set actions based on it!\n \n Im curious how did you find my blog<span class='author-marker'></span>"
        },
        {
            "Name": "Soeren Koenig",
            "Date": "2023-05-21",
            "Comment": "Sure, just wanted to share my own experience with goal setting. For me, actionable tasks work better with restricted timeboxing instead of being open-ended. So instead of \"workout everyday at least for 30 minutes\", it would be \"every day at 9:00 it is time to workout, for 30 minutes max\". How exactly this 30-minute session looks like is not that important, but I only have exactly this time slot, and when it has passed, then the chance is gone for today. Keeps me focused and allows for auto-regulation.\n \n \n \n I found your blog as I was looking for digital garden implementations. Specifically, for how to separate private from public gardens (how to do that technically - git branches, symlinks to another repo etc?)."
        }
    ],
    "zone-2-training": [
        {
            "Name": "James",
            "Date": "2023-05-24",
            "Comment": "Hi Rishikesh. \n \n Came across this in my search for zone 2 stuff, thanks for the info! Went on my first zone 2 \"run\" today and found it hard to stay so slow. Any update? How did it work out for you?\n \n Cheers,\n \n James"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-01-16",
            "Comment": "It was quite hard at the beginning. I think overtime your body adapts. When I started I had to walk at times because my heart rate was shooting! <span class='author-marker'></span>"
        }
    ],
    "watchlist": [
        {
            "Name": "Jack s",
            "Date": "2024-07-08",
            "Comment": "If you haven?t seen, Silence of the Lambs, add it to your list!"
        }
    ],
    "blog-art": [
        {
            "Name": "zak",
            "Date": "2024-10-18",
            "Comment": "Well put! You've captured the blog as a living, breathing art so nicely!"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-10-19",
            "Comment": "<span class='author-marker'></span>Thanks a lot Zak for the feedback! :)"
        }
    ],
    "name": [
        {
            "Name": "Drago",
            "Date": "2024-11-07",
            "Comment": "Bulgarian is ok"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-07",
            "Comment": "<span class='author-marker'></span> Thanks a lot Drago! I've marked it as verified!"
        },
        {
            "Name": "Sasha",
            "Date": "2024-11-07",
            "Comment": "Serbian is confirmed"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-07",
            "Comment": "<span class='author-marker'></span> Thanks a lot Sasha! I've updated it!"
        }
    ],
    "file-over-app": [
        {
            "Name": "Algo Rithm",
            "Date": "2024-11-18",
            "Comment": "So, is Agent Mortimer going to live?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-18",
            "Comment": "<span class='author-marker'>Agent Mortimer will live as long as plain text does?forever!"
        },
        {
            "Name": "NotABug",
            "Date": "2024-11-18",
            "Comment": "Other \"file over app\" are Logseq (https://logseq.com/) and Silverbullet (https://silverbullet.md/)"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-18",
            "Comment": "<span class='author-marker'></span>This looks wonderful, I shall update the list!"
        },
        {
            "Name": "Derek Sivers",
            "Date": "2024-11-18",
            "Comment": "\"File over app\" is a brilliant simple way of explaining this.  Thank you for posting this!\r\n\r\nI'll be forwarding this to others (probably for years to come since I keep my bookmarks in a bookmarks.txt file, for easy reference even years later.)"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-18",
            "Comment": "<span class='author-marker'></span>Thanks a lot Derek! It's not my idea, I just scribbled some thoughts! I never thought of bookmarks.txt, great idea!"
        },
        {
            "Name": "jfd",
            "Date": "2024-11-18",
            "Comment": "Try httpyac over bruno"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-18",
            "Comment": "<span class='author-marker'></span> In what context? Bruno was mentioned because it stores API information in plain text format."
        },
        {
            "Name": "Burno",
            "Date": "2024-11-18",
            "Comment": "Emacs with org mode"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-19",
            "Comment": "<span class='author-marker'></span>Great one! I've added it!"
        },
        {
            "Name": "Volky",
            "Date": "2024-11-20",
            "Comment": "Mochi for spaced repetition"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-20",
            "Comment": "<span class='author-marker'></span> How does Mochi fit into this? It supports markdown, but I believe the exports are still a mess and the flashcards can be only opened via Mochi. You haven't left your email, so I'm unable to contact you, but do correct me if I'm wrong!"
        },
        {
            "Name": "Antoine Le Baux",
            "Date": "2024-11-20",
            "Comment": "I was sold on the file over app idea, but couldn't find one for photos, so with some friends we started our own app that uses image metadata to do this, in case you want to give it a look: https://onefolder.app"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-20",
            "Comment": "<span class='author-marker'></span> Great work! I've added it to the list!"
        },
        {
            "Name": "SSP",
            "Date": "2024-12-04",
            "Comment": "Markor for editing .md files on android phones is great. More so because of the templates that you can define and use to publish to Hugo."
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-12-06",
            "Comment": "<span class='author-marker'></span>Thanks a lot for the suggestion. I've added it to the list!"
        },
        {
            "Name": "Miika",
            "Date": "2024-12-21",
            "Comment": "Do not forget definite standard for textual book-keeping: \r\n[Ledger](https://en.wikipedia.org/wiki/Ledger_(software) and\r\n[hLedger](https://hledger.org/)"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-12-26",
            "Comment": "<span class='author-marker'></span> You are correct! I should have mentioned them at the top. I've added them to the list. Thanks for the suggestion!"
        }
    ],
    "ama": [
        {
            "Name": "Nevin Lopez",
            "Date": "2024-09-20",
            "Comment": "Why did you move your blog from Wordpress to Hugo?"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-09-20",
            "Comment": "<span class='author-marker'>I loved WordPress for it's convenience. But as I learned programming and started seeing other personal blogs, I wanted to add new features that were impossible with a WordPress website. Also, developing your website from scratch knowing all the components was fun. I'm not there yet fully as this website is built using Hugo framework, but in the future, I would move to a custom framework and own everything end-to-end. "
        }
    ],
    "blog-version": [
        {
            "Name": "Erik",
            "Date": "2024-11-28",
            "Comment": "I like your version system, but rather than YY.Push.Type.DDMM I'd prefer YY.Push.Type.MMDD, which would be closer to the familiar yyyy-mm-dd format"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-11-28",
            "Comment": "<span class='author-marker'></span>Thanks a lot for the feedback. Yes in that perspective, MMDD makes sense. But for me personally, DDMM clicks in my mind as a date. In India we use DDMMYY, probably because of that!"
        }
    ],
    "til/bike-pedal-reverse": [
        {
            "Name": "Lex",
            "Date": "2024-12-25",
            "Comment": "mnemonic rule to remember: left pedal - \"left\" threading, not \"right\"! (with \"right\" meaning \"correct\", \"usual\")"
        },
        {
            "Name": "Rishikesh",
            "Date": "2024-12-26",
            "Comment": "<span class='author-marker'></span> That's a good one! I've added it to the post!"
        }
    ]
}